{
  "2024-06-11": [
    "Is Apple Inc. (NASDAQ:AAPL) Billionaire Paul Tudor Jones’ Best Stock Pick in 2024?",
    "🔒 Musk threatens Apple ban over OpenAI integration concerns",
    "Elon Musk threatens to ban Apple devices if OpenAI integrated into OS"
  ],
  "2024-06-25": [
    "Apple Inc (NASDAQ:AAPL): The Best Undervalued AI Stock to Buy Now?",
    "Apple rejected idea of iPhone AI partnership with Meta months ago",
    "Apple intensifies user experience for Vision Pro"
  ],
  "2024-07-10": [
    "Results similar to 'apple-inc-aapl-dominating-through-innovation-and-financial-resilience'",
    "Apple targets 10% iPhone shipment growth in 2024",
    "Microsoft, Apple Give Up OpenAI Board Seats"
  ],
  "2024-08-05": [
    "Apple Hospitality REIT Inc (APLE) Q2 2024 Earnings: EPS of $0.31 Beats Estimates, Revenue of $390.08M Exceeds Expectations",
    "Navigating Market Uncertainty: Intrinsic Value of Apple Inc",
    "Apple supplier stocks slump after Berkshire nearly halves stake"
  ],
  "2025-03-10": [
    "Apple Inc (AAPL) Trading Down 5.81% on Mar 10",
    "Apple (AAPL) Shares Decline Amid Market Turbulence",
    "Apple (AAPL) and Meta (META) Face EU Fines for Digital Markets Act Violation"
  ],
  "2025-04-03": [
    "Apple (AAPL) Affected by New Tariffs, Shares Fall",
    "Apple (AAPL) Faces Steep Cost Hike from New Tariffs",
    "Apple (AAPL) Faces Steep Decline Amid Tariff Concerns"
  ],
  "2025-04-04": [
    "Apple (AAPL) Faces Major Stock Decline Amid New Tariffs",
    "Industry Comparison: Evaluating Apple Against Competitors In Technology Hardware, Storage & Peripherals Industry - Apple (NASDAQ:AAPL)",
    "Apple (AAPL) Faces Setbacks in AI Push Amid Industry Pressure"
  ],
  "2025-04-08": [
    "Performance Comparison: Apple And Competitors In Technology Hardware, Storage & Peripherals Industry - Apple (NASDAQ:AAPL)",
    "Despite Tariff Turmoil, Bitcoin Outperforms 'Magnificent 7' Stocks In 2025 — Records Smaller Losses Than Nvidia, Tesla, Apple - Apple (NASDAQ:AAPL)",
    "Marvell Technology, Nvidia, Tesla, Apple And Other Big Stocks Moving Higher On Tuesday - Apple (NASDAQ:AAPL), Applied Optoelectronics (NASDAQ:AAOI)"
  ],
  "2025-04-09": [
    "Apple Inc (AAPL) Shares Up 4.4% on Apr 9",
    "Apple (AAPL) Shares Rebound Amid Trade Concerns",
    "Apple (AAPL) Faces Downgrade Amid Tariff Concerns"
  ],
  "2025-04-11": [
    "Is Apple Inc. (AAPL)the Top Tech Stock to Buy According to Billionaire Ken Fisher?",
    "Apple (AAPL) Faces Challenges Amid U.S.-China Trade Tensions",
    "Apple (AAPL) Faces Pricing Challenge from U.S.-China Tariff Concerns"
  ],
  "2025-04-14": [
    "Apple Inc (AAPL)'s Winning Formula: Financial Metrics and Competitive Strengths",
    "Apple Inc. (AAPL): “China Would Lose 2 Million Workers,” Says Jim Cramer",
    "Apple Inc (AAPL) in Invesco Charter Fund Q3 2024"
  ],
  "2025-04-15": [
    "Apple Inc. (AAPL) in Third Point Capital 2024 Q2",
    "Is Apple Inc. (AAPL) The Best American Tech Stock to Buy Now?",
    "Apple Inc. (AAPL) in Harbor Capital Appreciation Fund Q2 2024"
  ],
  "2025-04-23": [
    "Apple (AAPL) Faces Tariff Challenges Ahead of Q2 Results",
    "Analyzing Apple In Comparison To Competitors In Technology Hardware, Storage & Peripherals Industry - Apple (NASDAQ:AAPL)",
    "Apple (AAPL) Hit with €500M EU Fine Over Digital Markets Act Breach"
  ],
  "2025-05-01": [
    "Apple Inc. Q2 2025 Earnings: EPS of $1.65 and Revenue of $95.4 Billion Surpass Estimates",
    "Apple Inc. (AAPL): Jim Cramer Braces for Earnings — “We Think They’re Going to Miss”",
    "Apple (AAPL) Faces Legal Setback in Epic Games Dispute"
  ],
  "2025-05-12": [
    "Apple Inc (AAPL) Shares Up 5.43% on May 12",
    "Apple (AAPL) Considers iPhone Price Hike Amid Strategic Changes",
    "Navigating Market Uncertainty: Intrinsic Value of Apple Inc"
  ]
}